/**********************************************************************************
// PacMan (Arquivo de Cabeçalho)
//
// Criação:     01 Jan 2013
// Atualização: 04 Mar 2023
// Compilador:  Visual C++ 2022
//
// Descrição:   Exercício sobre detecção de colisão
//
**********************************************************************************/

#ifndef _INDEX_H_
#define _INDEX_H_

// ------------------------------------------------------------------------------

enum GameObjects
{
    PLAYER,
    ENEMY,
    ARROW
};

// ------------------------------------------------------------------------------

#endif

